{
  "config": {
    "announcementBar": {
      "validationApp": "🚀 Téléchargez notre application de validation pour essayer Tauri : <br/> <i class=\"ti-linux\"></i> <a href=\"https://github.com/tauri-apps/tauri/releases/download/0.5.2-binaries/app_0.1.0_amd64.deb\" target=\"_blank\">Linux - deb</a>- <i class=\"ti-apple\"></i> <a href=\"https://github.com/tauri-apps/tauri/releases/download/0.5.2-binaries/app-macos.dmg\" target=\"_blank\">MacOS - dmg</a>- <i class=\"ti-microsoft\"></i> <a href=\"https://github.com/tauri-apps/tauri/releases/download/0.5.2-binaries/app.x64.msi\" target=\"_blank\">Windows - msi</a>- <i class=\"ti-github\"></i> <a href=\"https://github.com/tauri-apps/tauri/tree/dev/tauri/examples/communication\" target=\"_blank\">Source</a>"
    },
    "tagline": "Créez des applications desktop plus légères, plus rapides et plus sécurisées avec un front-end web"
  },
  "pages": {
    "index": {
      "description": "Tauri est un framework pour créer de petits binaires ultra rapides pour toutes les principales plateformes bureau. Les développeurs peuvent intégrer n'importe quel framework front-end qui compile en HTML, JS et CSS pour construire leur interface utilisateur.",
      "subtitle": "Créez des applications desktop plus petites, plus rapides et plus sécurisées<br/> avec un front-end web",
      "learnMore": "En savoir plus",
      "getStarted": "Commencer",
      "feature": {
        "seeMore": "En savoir plus",
        "items": [
          {
            "label": "Site web",
            "description": "la compatibilité avec tout framework front signifie que vous n'avez pas à changer votre stack"
          },
          {
            "label": "FLOSS",
            "description": "le changement de licence est possible avec Tauri"
          },
          {
            "label": "Paquet",
            "description": "la taille d'une application Tauri peut être inférieure à 600Kb"
          },
          {
            "label": "Sécurité",
            "description": "est la plus grande priorité de l'équipe Tauri et motive notre innovation"
          },
          {
            "label": "Les modèles",
            "description": "permettent de choisir des fonctionnalités facilement"
          },
          {
            "label": "Multi-platforme",
            "description": "la compilation permet de générer des binaires pour les principales plateformes de bureau (mobile et WASM à venir)"
          }
        ]
      },
      "roadmap": {
        "title": "Feuille de route",
        "notice": "Note : Cette feuille de route est sujette à modification.",
        "beyond": "Et au delà",
        "todo": "À faire",
        "milestone": "Étape",
        "ready": "Prêt",
        "items": [
          {
            "label": "CLI",
            "description": "Générez, développez et construisez des applications Tauri depuis la ligne de commande."
          },
          {
            "label": "API",
            "description": "Finalisation, audit, écriture de la documentation et création des exemples pour les smoke-tests."
          },
          {
            "label": "Tests & CI",
            "description": "Implémente une CI avec une pipeline de tests et validations."
          },
          {
            "label": "Paquetage pour environnement de bureau",
            "description": "Paquetage sur tous les principaux environnements de bureau à partir de systèmes natifs."
          },
          {
            "label": "Version Alpha",
            "description": "Version candidate technique pour desktop, les effets de bord et bugs sont acceptables."
          },
          {
            "label": "Chargeur latéral",
            "description": "Intègre et instrumente les autres binaires."
          },
          {
            "label": "Écran de démarrage",
            "description": "Utilisez un écran de démarrage pendant le chargement du contenu principal."
          },
          {
            "label": "Stockage pour les applications",
            "description": "Utilise un emplacement canonique pour stocker les données d'utilisateur."
          },
          {
            "label": "Notifications natives",
            "description": "Notifications multi-plateformes utilisant un polyfill de l'API WEB."
          },
          {
            "label": "Mise en place de GH Action pour compiler les applications",
            "description": "Construisez votre application Web en tant que binaire Tauri pour macOS, Linux et Windows"
          },
          {
            "label": "Extension VS Code",
            "description": "Raccourcis et validation du tauri.conf.json"
          },
          {
            "label": "Plugin pour le système principal",
            "description": "Créez des extensions réutilisables pour Tauri."
          },
          {
            "label": "Mise à jour CLI",
            "description": "Mettre à jour automatiquement les dépendances principales à partir du CLI."
          },
          {
            "label": "Mise à jour automatique",
            "description": "Mettre à jour les applications Tauri depuis Tauri."
          },
          {
            "label": "Presse-papiers",
            "description": "Activer l'accès programmatique et clavier au presse-papiers."
          },
          {
            "label": "Raccourcis clavier",
            "description": "Récupère et réagi aux touches pressées."
          },
          {
            "label": "Channel API",
            "description": "Envoyez des messages via un canal."
          },
          {
            "label": "Commandes à usage unique",
            "description": "Exécutez une commande qui n'est plus disponible après la première exécution."
          },
          {
            "label": "Paquet WASM",
            "description": "Fabrication de paquet WASM pour utilisation sur des sites Web."
          },
          {
            "label": "Plateau d'applications",
            "description": "Icône de barre d'état multi-plateforme."
          },
          {
            "label": "Interface Webview",
            "description": "Utilisez l'interface officiel de Webview."
          },
          {
            "label": "Multi-fenêtre",
            "description": "Exécutez plusieurs instances de fenêtre dans Tauri."
          },
          {
            "label": "Fenêtre transparente",
            "description": "Avoir des fenêtres transparentes."
          },
          {
            "label": "CLI basé sur Rust",
            "description": "Créez un CLI rust avec des interfaces et binaires DENO."
          },
          {
            "label": "Interface DENO",
            "description": "Utilisez Deno pour développer le back-end de votre application."
          },
          {
            "label": "Version bêta",
            "description": "Globalement stable sur bureau, API verrouillée."
          },
          {
            "label": "Audit de sécurité",
            "description": "Audit de sécurité sur les bibliothèques principales par une tierce partie."
          },
          {
            "label": "Paquetage mobile",
            "description": "Paquetage pour tous les principaux systèmes d'exploitation de périphériques mobiles."
          },
          {
            "label": "Compilateur multi-plateforme",
            "description": "Générez des binaires paquetés à partir de certains environnements de système d'exploitation."
          },
          {
            "label": "Magazin PureOS",
            "description": "Compilations vérifiées pour PureOS."
          },
          {
            "label": "Version stable",
            "description": "Stable sur toutes les plateformes."
          },
          {
            "label": "Autres interfaces",
            "description": "Go, Nim, Python, C++ et d'autres interfaces sont possibles avec l'API stable."
          },
          {
            "label": "Rendu alternatif",
            "description": "Présentation candidate pour les alternatives à Webview, y compris le fenêtrage GL."
          },
          {
            "label": "Tauri-Frida",
            "description": "Un décompilateur et un analyseur de risques pour les applications Tauri, en utilisant Frida."
          },
          {
            "label": "Le futur",
            "description": "Il manque quelque chose ? Vous avez une idée géniale ? Nous souhaitons que vous nous aidiez à la réaliser."
          }
        ]
      }
    },
    "partners": {
      "partnersLabel": "Partenaires",
      "sponsors": [
        {
          "description": "L'infrastructure de ce projet est en partie soutenue par Digital Ocean. Cliquez sur le bouton ici pour visiter le site web de Digital Ocean et obtenir un crédit de 100$ que vous pourrez utiliser dans les 60 jours."
        },
        {
          "description": "Nos documentations sont continuellement déployées grâce à l'aimable soutien et aux outils étonnants que nous fournit netlify. Leur service permet d'avoir une CI continue et nous permet de nous focaliser sur les fonctionnalités."
        },
        {
          "description": "Mailscript nous permet d'automatiser et de gérer nos nombreuses notifications github et d'appliquer des actions graduelles aux courriers en utilisant des règles spécifiques. Qu'il s'agisse de redirections, de captures, de webhooks ou même de notifications par SMS - MailScript() continue d'innover !"
        },
        {
          "description": "ClickUp est une application qui les remplace toutes. C'est l'avenir du travail - où chacun peut travailler sur n'importe quoi. Plus qu'une simple gestion des tâches, ClickUp propose des documents, des rappels, des objectifs, des calendriers, un planning et même une boîte de réception. Entièrement personnalisable, ClickUp fonctionne pour tout type d'équipe, de sorte que toutes les équipes peuvent utiliser la même application pour planifier, organiser et collaborer."
        },
        {
          "description": "Les membres géniaux de wallaby.js ont fait le bonheur de l'équipe principal de Tauri avec leur REPL futuriste pour les tests IDE. Si vous évitez de tester votre JS parce que cela prend trop de temps - avec wallaby vous apprécierez le retour d'information immédiat. De notre côté, nous apprécions fortement !"
        }
      ],
      "collaboratorsLabel": "Collaborateurs",
      "collaborators": [
        {
          "description": "GUIJS est une boîte à outils pour vous faciliter la vie. Cette collaboration a permis à l'extension de Tauri d'avoir un nouveau mode, le sidecar."
        },
        {
          "description": "On peut dire que les humbles débuts de Tauri remontent à une conversation où PureOS expliquait que les applications Electron ne seront jamais disponibles sur la plateforme officielle de PureOS, et qu'il faudrait autre chose."
        },
        {
          "description": "Le premier adepte de Tauri, de proches collaborateurs ayant des intérêts communs. IOTA est une technologie distribué sans autorisation, sans minage et adaptée aux appareils de faible puissance."
        },
        {
          "description": "Un moteur de jeu basé sur les données, dans Rust - qui s'engage à alimenter une communauté open source."
        },
        {
          "description": "Si PureOS a planté la graine de Tauri, Kayaba de Meros a vraiment donné un coup de pied dans la machine avec une question parfaitement planifiée."
        },
        {
          "description": "TensorProgramming, l'un des professionnels les plus polyglottes, partage ses connaissances et son enthousiasme pour des dizaines de langages de programmation différents sur sa chaîne YouTube."
        }
      ],
      "patronsLabel": "Patrons"
    },
    "showcase": {
      "content": "Voici les applications qui ont été faites avec Tauri !",
      "projects": [
        {
          "description": ""
        },
        {
          "description": "Une application gratuite, légère, simple, belle et utile pour faire un tirage au sort ou pour passer un appel nominal."
        },
        {
          "description": "Écrire du texte en arabe sur des applications qui ne prennent pas en charge le texte bidirectionnel."
        }
      ],
      "yourProject": "Votre projet",
      "addIt": "Ajoutez-le !"
    }
  },
  "navbar": {
    "about": "À propos",
    "docs": "Docs",
    "api": "API",
    "community": "Communauté",
    "partners": "Partenaires",
    "showcase": "Vitrine",
    "usage": "Usage",
    "gettingStarted": "Pour commencer",
    "contact": "Contact",
    "mail": "Courriel",
    "network": "Réseau"
  },
  "navigation": {
    "pagination": {
      "next": "Suivant",
      "previous": "Précédent"
    }
  },
  "misc": {
    "editPage": "Modifier cette page"
  },
  "global": {
    "discover": "Découvrir"
  }
}